tsbiberdorf/sampleLwIPFreeRTOS/board/pin_mux.c
/* FUNCTION ************************************************************************************************************
 *
 * Function Name : BOARD_InitPins
 * Description   : Configures pin routing and optionally pin electrical features.
 *
 * END ****************************************************************************************************************/
void BOARD_InitPins(void)
{
    /* Port A Clock Gate Control: Clock enabled */
    CLOCK_EnableClock(kCLOCK_PortA);
    /* Port B Clock Gate Control: Clock enabled */
    CLOCK_EnableClock(kCLOCK_PortB);
    /* Port C Clock Gate Control: Clock enabled */
    CLOCK_EnableClock(kCLOCK_PortC);
    /* Port D Clock Gate Control: Clock enabled */
    CLOCK_EnableClock(kCLOCK_PortD);
    /* Port E Clock Gate Control: Clock enabled */
    CLOCK_EnableClock(kCLOCK_PortE);

    gpio_pin_config_t RELAY_TRIP_config = {
        .pinDirection = kGPIO_DigitalOutput,
        .outputLogic = 0U
    };
    /* Initialize GPIO functionality on pin PTC0 (pin 70)  */
    GPIO_PinInit(BOARD_RELAY_TRIP_GPIO, BOARD_RELAY_TRIP_PIN, &RELAY_TRIP_config);

    gpio_pin_config_t RELAY_NGR_config = {
        .pinDirection = kGPIO_DigitalOutput,
        .outputLogic = 0U
    };
    /* Initialize GPIO functionality on pin PTC1 (pin 71)  */
    GPIO_PinInit(BOARD_RELAY_NGR_GPIO, BOARD_RELAY_NGR_PIN, &RELAY_NGR_config);

    gpio_pin_config_t RELAY_AUX_config = {
        .pinDirection = kGPIO_DigitalOutput,
        .outputLogic = 0U
    };
    /* Initialize GPIO functionality on pin PTC2 (pin 72)  */
    GPIO_PinInit(BOARD_RELAY_AUX_GPIO, BOARD_RELAY_AUX_PIN, &RELAY_AUX_config);

    gpio_pin_config_t RELAY_GND_config = {
        .pinDirection = kGPIO_DigitalOutput,
        .outputLogic = 0U
    };
    /* Initialize GPIO functionality on pin PTC4 (pin 76)  */
    GPIO_PinInit(BOARD_RELAY_GND_GPIO, BOARD_RELAY_GND_PIN, &RELAY_GND_config);

    gpio_pin_config_t TRIPPED_LED_config = {
        .pinDirection = kGPIO_DigitalOutput,
        .outputLogic = 0U
    };
    /* Initialize GPIO functionality on pin PTC5 (pin 77)  */
    GPIO_PinInit(BOARD_TRIPPED_LED_GPIO, BOARD_TRIPPED_LED_PIN, &TRIPPED_LED_config);

    gpio_pin_config_t NGR_FLT_LED_config = {
        .pinDirection = kGPIO_DigitalOutput,
        .outputLogic = 0U
    };
    /* Initialize GPIO functionality on pin PTC6 (pin 78)  */
    GPIO_PinInit(BOARD_NGR_FLT_LED_GPIO, BOARD_NGR_FLT_LED_PIN, &NGR_FLT_LED_config);

    gpio_pin_config_t GND_FLT_LED_config = {
        .pinDirection = kGPIO_DigitalOutput,
        .outputLogic = 0U
    };
    /* Initialize GPIO functionality on pin PTC7 (pin 79)  */
    GPIO_PinInit(BOARD_GND_FLT_LED_GPIO, BOARD_GND_FLT_LED_PIN, &GND_FLT_LED_config);

    gpio_pin_config_t WIFI_ENABLE_config = {
        .pinDirection = kGPIO_DigitalInput,
        .outputLogic = 0U
    };
    /* Initialize GPIO functionality on pin PTC8 (pin 80)  */
    GPIO_PinInit(BOARD_WIFI_ENABLE_GPIO, BOARD_WIFI_ENABLE_PIN, &WIFI_ENABLE_config);

    gpio_pin_config_t TEST_P_config = {
        .pinDirection = kGPIO_DigitalInput,
        .outputLogic = 0U
    };
    /* Initialize GPIO functionality on pin PTC9 (pin 81)  */
    GPIO_PinInit(BOARD_TEST_P_GPIO, BOARD_TEST_P_PIN, &TEST_P_config);

    gpio_pin_config_t RESET_P_config = {
        .pinDirection = kGPIO_DigitalInput,
        .outputLogic = 0U
    };
    /* Initialize GPIO functionality on pin PTC10 (pin 82)  */
    GPIO_PinInit(BOARD_RESET_P_GPIO, BOARD_RESET_P_PIN, &RESET_P_config);

    gpio_pin_config_t HMI_RS485_DIR_config = {
        .pinDirection = kGPIO_DigitalOutput,
        .outputLogic = 0U
    };
    /* Initialize GPIO functionality on pin PTC18 (pin 92)  */
    GPIO_PinInit(BOARD_HMI_RS485_DIR_GPIO, BOARD_HMI_RS485_DIR_PIN, &HMI_RS485_DIR_config);

    gpio_pin_config_t SENSOR_RS485_DIR_config = {
        .pinDirection = kGPIO_DigitalOutput,
        .outputLogic = 0U
    };
    /* Initialize GPIO functionality on pin PTD0 (pin 93)  */
    GPIO_PinInit(BOARD_SENSOR_RS485_DIR_GPIO, BOARD_SENSOR_RS485_DIR_PIN, &SENSOR_RS485_DIR_config);

    gpio_pin_config_t POWER_LED_config = {
        .pinDirection = kGPIO_DigitalOutput,
        .outputLogic = 0U
    };
    /* Initialize GPIO functionality on pin PTD4 (pin 97)  */
    GPIO_PinInit(BOARD_POWER_LED_GPIO, BOARD_POWER_LED_PIN, &POWER_LED_config);

    gpio_pin_config_t WIFI_LED_config = {
        .pinDirection = kGPIO_DigitalOutput,
        .outputLogic = 0U
    };
    /* Initialize GPIO functionality on pin PTD5 (pin 98)  */
    GPIO_PinInit(BOARD_WIFI_LED_GPIO, BOARD_WIFI_LED_PIN, &WIFI_LED_config);

    gpio_pin_config_t SENSOR_LED_config = {
        .pinDirection = kGPIO_DigitalOutput,
        .outputLogic = 0U
    };
    /* Initialize GPIO functionality on pin PTD6 (pin 99)  */
    GPIO_PinInit(BOARD_SENSOR_LED_GPIO, BOARD_SENSOR_LED_PIN, &SENSOR_LED_config);

    gpio_pin_config_t WINC_CHIPEN_config = {
        .pinDirection = kGPIO_DigitalOutput,
        .outputLogic = 0U
    };
    /* Initialize GPIO functionality on pin PTE0 (pin 1)  */
    GPIO_PinInit(BOARD_WINC_CHIPEN_GPIO, BOARD_WINC_CHIPEN_PIN, &WINC_CHIPEN_config);

    gpio_pin_config_t WINC_RESET_config = {
        .pinDirection = kGPIO_DigitalOutput,
        .outputLogic = 0U
    };
    /* Initialize GPIO functionality on pin PTE5 (pin 6)  */
    GPIO_PinInit(BOARD_WINC_RESET_GPIO, BOARD_WINC_RESET_PIN, &WINC_RESET_config);

    gpio_pin_config_t WINC_IRQ_config = {
        .pinDirection = kGPIO_DigitalInput,
        .outputLogic = 0U
    };
    /* Initialize GPIO functionality on pin PTE6 (pin 7)  */
    GPIO_PinInit(BOARD_WINC_IRQ_GPIO, BOARD_WINC_IRQ_PIN, &WINC_IRQ_config);

    /* PORTA12 (pin 42) is configured as RMII0_RXD1 */
    PORT_SetPinMux(PORTA, 12U, kPORT_MuxAlt4);

    /* PORTA13 (pin 43) is configured as RMII0_RXD0 */
    PORT_SetPinMux(PORTA, 13U, kPORT_MuxAlt4);

    /* PORTA14 (pin 44) is configured as RMII0_CRS_DV */
    PORT_SetPinMux(PORTA, 14U, kPORT_MuxAlt4);

    /* PORTA15 (pin 45) is configured as RMII0_TXEN */
    PORT_SetPinMux(PORTA, 15U, kPORT_MuxAlt4);

    /* PORTA16 (pin 46) is configured as RMII0_TXD0 */
    PORT_SetPinMux(PORTA, 16U, kPORT_MuxAlt4);

