tsbiberdorf/sampleLwIPFreeRTOS/board/pin_mux.c
                     /* Passive Filter Enable: Passive input filter is enabled on the corresponding pin, if the
                      * pin is configured as a digital input.
                      * Refer to the device data sheet for filter characteristics. */
                     | PORT_PCR_PFE(kPORT_PassiveFilterEnable));

    /* PORTD0 (pin 93) is configured as PTD0 */
    PORT_SetPinMux(BOARD_SENSOR_RS485_DIR_PORT, BOARD_SENSOR_RS485_DIR_PIN, kPORT_MuxAsGpio);

    PORTD->PCR[0] = ((PORTD->PCR[0] &
                      /* Mask bits to zero which are setting */
                      (~(PORT_PCR_DSE_MASK | PORT_PCR_ISF_MASK)))

                     /* Drive Strength Enable: High drive strength is configured on the corresponding pin, if pin
                      * is configured as a digital output. */
                     | PORT_PCR_DSE(kPORT_HighDriveStrength));

    /* PORTD2 (pin 95) is configured as UART2_RX */
    PORT_SetPinMux(BOARD_SENSOR_RS485_RX_PORT, BOARD_SENSOR_RS485_RX_PIN, kPORT_MuxAlt3);

    /* PORTD3 (pin 96) is configured as UART2_TX */
    PORT_SetPinMux(BOARD_SENSOR_RS485_TX_PORT, BOARD_SENSOR_RS485_TX_PIN, kPORT_MuxAlt3);

    /* PORTD4 (pin 97) is configured as PTD4 */
    PORT_SetPinMux(BOARD_POWER_LED_PORT, BOARD_POWER_LED_PIN, kPORT_MuxAsGpio);

    PORTD->PCR[4] = ((PORTD->PCR[4] &
                      /* Mask bits to zero which are setting */
                      (~(PORT_PCR_DSE_MASK | PORT_PCR_ISF_MASK)))

                     /* Drive Strength Enable: High drive strength is configured on the corresponding pin, if pin
                      * is configured as a digital output. */
                     | PORT_PCR_DSE(kPORT_HighDriveStrength));

    /* PORTD5 (pin 98) is configured as PTD5 */
    PORT_SetPinMux(BOARD_WIFI_LED_PORT, BOARD_WIFI_LED_PIN, kPORT_MuxAsGpio);

    PORTD->PCR[5] = ((PORTD->PCR[5] &
                      /* Mask bits to zero which are setting */
                      (~(PORT_PCR_DSE_MASK | PORT_PCR_ISF_MASK)))

                     /* Drive Strength Enable: High drive strength is configured on the corresponding pin, if pin
                      * is configured as a digital output. */
                     | PORT_PCR_DSE(kPORT_HighDriveStrength));

    /* PORTD6 (pin 99) is configured as PTD6 */
    PORT_SetPinMux(BOARD_SENSOR_LED_PORT, BOARD_SENSOR_LED_PIN, kPORT_MuxAsGpio);

    PORTD->PCR[6] = ((PORTD->PCR[6] &
                      /* Mask bits to zero which are setting */
                      (~(PORT_PCR_DSE_MASK | PORT_PCR_ISF_MASK)))

                     /* Drive Strength Enable: High drive strength is configured on the corresponding pin, if pin
                      * is configured as a digital output. */
                     | PORT_PCR_DSE(kPORT_HighDriveStrength));

    /* PORTE0 (pin 1) is configured as PTE0 */
    PORT_SetPinMux(BOARD_WINC_CHIPEN_PORT, BOARD_WINC_CHIPEN_PIN, kPORT_MuxAsGpio);

    PORTE->PCR[0] = ((PORTE->PCR[0] &
                      /* Mask bits to zero which are setting */
                      (~(PORT_PCR_PE_MASK | PORT_PCR_ISF_MASK)))

                     /* Pull Enable: Internal pullup or pulldown resistor is enabled on the corresponding pin. */
                     | (uint32_t)(PORT_PCR_PE_MASK));

    /* PORTE1 (pin 2) is configured as SPI1_SOUT */
    PORT_SetPinMux(BOARD_WINC_MOSI_PORT, BOARD_WINC_MOSI_PIN, kPORT_MuxAlt2);

    /* PORTE2 (pin 3) is configured as SPI1_SCK */
    PORT_SetPinMux(BOARD_WINC_SCK_PORT, BOARD_WINC_SCK_PIN, kPORT_MuxAlt2);

    /* PORTE26 (pin 33) is configured as ENET_1588_CLKIN */
    PORT_SetPinMux(PORTE, 26U, kPORT_MuxAlt2);

    /* PORTE3 (pin 4) is configured as SPI1_SIN */
    PORT_SetPinMux(BOARD_WINC_MISO_PORT, BOARD_WINC_MISO_PIN, kPORT_MuxAlt2);

    /* PORTE4 (pin 5) is configured as SPI1_PCS0 */
    PORT_SetPinMux(BOARD_WINC_CS_PORT, BOARD_WINC_CS_PIN, kPORT_MuxAlt2);

    PORTE->PCR[4] = ((PORTE->PCR[4] &
                      /* Mask bits to zero which are setting */
                      (~(PORT_PCR_PE_MASK | PORT_PCR_ISF_MASK)))

                     /* Pull Enable: Internal pullup or pulldown resistor is not enabled on the corresponding pin. */
                     | PORT_PCR_PE(kPORT_PullDisable));

    /* PORTE5 (pin 6) is configured as PTE5 */
    PORT_SetPinMux(BOARD_WINC_RESET_PORT, BOARD_WINC_RESET_PIN, kPORT_MuxAsGpio);

    PORTE->PCR[5] = ((PORTE->PCR[5] &
                      /* Mask bits to zero which are setting */
                      (~(PORT_PCR_PS_MASK | PORT_PCR_PE_MASK | PORT_PCR_ISF_MASK)))

                     /* Pull Select: Internal pulldown resistor is enabled on the corresponding pin, if the
                      * corresponding PE field is set. */
                     | (uint32_t)(kPORT_PullDown));

    /* PORTE6 (pin 7) is configured as PTE6 */
    PORT_SetPinMux(BOARD_WINC_IRQ_PORT, BOARD_WINC_IRQ_PIN, kPORT_MuxAsGpio);

    /* Interrupt configuration on PORTE6 (pin 7): Interrupt on falling edge */
    PORT_SetPinInterruptConfig(BOARD_WINC_IRQ_PORT, BOARD_WINC_IRQ_PIN, kPORT_InterruptFallingEdge);

    PORTE->PCR[6] = ((PORTE->PCR[6] &
                      /* Mask bits to zero which are setting */
                      (~(PORT_PCR_PS_MASK | PORT_PCR_PE_MASK | PORT_PCR_ISF_MASK)))

                     /* Pull Select: Internal pullup resistor is enabled on the corresponding pin, if the
                      * corresponding PE field is set. */
                     | (uint32_t)(kPORT_PullUp));
}

/* clang-format off */
/*
 * TEXT BELOW IS USED AS SETTING FOR TOOLS *************************************
BOARD_InitButtonsPins:
- options: {prefix: BOARD_, coreID: core0, enableClock: 'true'}
- pin_list:
  - {pin_num: '78', peripheral: GPIOC, signal: 'GPIO, 6', pin_signal: CMP0_IN0/PTC6/LLWU_P10/SPI0_SOUT/PDB0_EXTRG/I2S0_RX_BCLK/FB_AD9/I2S0_MCLK, identifier: SW2,
    direction: INPUT, gpio_interrupt: kPORT_InterruptFallingEdge, slew_rate: fast, open_drain: disable, drive_strength: low, pull_select: up, pull_enable: enable,
    passive_filter: disable}
  - {pin_num: '38', peripheral: GPIOA, signal: 'GPIO, 4', pin_signal: PTA4/LLWU_P3/FTM0_CH1/NMI_b/EZP_CS_b, direction: INPUT, gpio_interrupt: kPORT_InterruptFallingEdge,
    slew_rate: fast, open_drain: disable, drive_strength: low, pull_select: down, pull_enable: disable, passive_filter: disable}
 * BE CAREFUL MODIFYING THIS COMMENT - IT IS YAML SETTINGS FOR TOOLS ***********
 */
/* clang-format on */

